tutorials/cfdemSolverVoF/bubbleRisingAgainstParticles/CFD/system/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;//0.008;

vertices
(
    (0. 0. 0.)
	(5. 0. 0.)
	(5. 5. 0.)
	(0. 5. 0.)
	(0. 0. 10.)
	(5. 0. 10.)
	(5. 5. 10.)
	(0. 5. 10.)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 100) 	simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
		 (1 2 6 5)
		 (2 3 7 6)
		 (0 4 7 3)
		 (0 1 5 4)

        );
    }
	
	inlet
    {
        type patch;
        faces
        (
        (0 3 2 1)//inlet
        );
    }

    outlet
    {
        type patch;//cyclicAMI;
        faces
        (
        (4 5 6 7)//outlet
        );
    }
);

// ************************************************************************* //
